app/controllers/api/v1/posts_controller.rb

INSERT INTO "posts" ("message", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["message", "hhhhhh"], ["created_at", "2018-10-04 10:11:36.749510"], ["updated_at", "2018-10-04 10:11:36.749510"], ["user_id", 2]]
---
      def create
        @post = Post.create(post_params)