app/controllers/api/v1/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "test@test.com"], ["LIMIT", 1]]
UPDATE "users" SET "authentication_token" = $1 WHERE "users"."id" = $2  [["authentication_token", "CNRUsu3W3Sbont7WzxUh"], ["id", 1]]
---
            def create
              @user = User.where(email: params[:email]).first
              if @user&.valid_password?(params[:password])
                @user.save