app/controllers/api/v1/users_controller.rb

      def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "authentication_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "hh@h.com"], ["encrypted_password", "$2a$11$w.Y38vfXfrNqrTN0kzt29eXTfHQ8BNSVrqfU2r/Zls.lyYijNgs1W"], ["authentication_token", "RkCGXzQkJTsmsSpxzkUd"]]